tests/WebformulierenVerwerker/scenario04/CorsaCreateFileVersionRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:bct="http://bct.nl" xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
	<soap:Header/>
	<soap:Body>
		<bct:CreateFileVersion>
			<bct:ObjectType>S</bct:ObjectType>
			<bct:ObjectID>BIJ.360830</bct:ObjectID>
			<bct:FileBytes/>
			<bct:FileType>ftNative</bct:FileType>
			<bct:FileVersion>0</bct:FileVersion>
			<bct:FileExtension>txt</bct:FileExtension>
			<bct:DocumentName>abc</bct:DocumentName>
			<bct:VersionDescription>Eerste versie</bct:VersionDescription>
		</bct:CreateFileVersion>
	</soap:Body>
</soap:Envelope>